In [19]:
import pandas as pd
import numpy as np

In [20]:
a = pd.read_csv('train.csv')
b = pd.read_csv('test.csv')
c = pd.read_csv('validation.csv')

In [21]:
d = pd.concat([a, b, c])

In [22]:
d.head()

,question,sql
0,Tell me what the notes are for South Australia,SELECT Notes FROM table WHERE Current slogan =...
1,What is the current series where the new serie...,SELECT Current series FROM table WHERE Notes =...
2,What is the format for South Australia?,SELECT Format FROM table WHERE State/territory...
3,Name the background colour for the Australian ...,SELECT Text/background colour FROM table WHERE...
4,how many times is the fuel propulsion is cng?,SELECT COUNT Fleet Series (Quantity) FROM tabl...

In [23]:
d.to_csv('wikisql.csv')

In [24]:
c1 = d['question']
c2 = d['sql']
join = []
groupby = []
orderby = []
where = []
max = []
min = []
count = []

for (e,f) in zip(c1,c2):
    if 'JOIN' in f:
        join.append([e,f])
    elif 'GROUP BY' in f:
        groupby.append([e,f])
    elif 'ORDER BY' in f:
        orderby.append([e,f])
    elif 'MAX' in f:
        max.append([e,f])
    elif 'MIN' in f:
        min.append([e,f])
    elif 'COUNT' in f:
        count.append([e,f])

In [25]:
len(join)

0

In [26]:
len(groupby)

0

In [27]:
len(orderby)

0

In [28]:
len(max)

4644

In [29]:
len(min)

4633

In [30]:
len(count)

7347

Due to Computational Constraints we will only be using 7500 records <br> 
2500 from each max, min and count respectively

In [31]:
max = max[:2500]
min = min[:2500]
count = count[:2500]

In [32]:
question = []
sql = []
for (i,j,k) in zip(max, min, count):
    question.append(i[0])
    question.append(j[0])
    question.append(k[0])
    sql.append(i[1])
    sql.append(j[1])
    sql.append(k[1])

df = pd.DataFrame()
df['question'] = question
df['sql'] = sql
df.head()

,question,sql
0,What time was the highest for 2nd finishers?,SELECT MAX 2nd FROM table
1,What number is the player that played 1998-2001,SELECT MIN No. FROM table WHERE Years in Toron...
2,how many times is the fuel propulsion is cng?,SELECT COUNT Fleet Series (Quantity) FROM tabl...
3,What is the number of chapters listed for the ...,SELECT MAX Chapters FROM table WHERE Classific...
4,When did the Metrostars have their first Rooki...,SELECT MIN Season FROM table WHERE Team = Metr...

In [33]:
df.shape

(7500, 2)

In [34]:
df.to_csv('wikisql_v3.csv')